import "./App.css";
import React from "react";

export default function Privacy() {
  return <p>

プライバシーポリシー<br/>

当シラバスは各種ログインサイトより、メールアドレスを取得します。(Twitterでのログインの場合のみメールアドレスは取得しません、代わりにIdを取得します。）取得理由は、
これはユーザーのレビュー情報を管理するものであり、ユーザーIDと紐づかせるためです。<br/>

また、最善を尽くしていますが、更新日的にすこしシラバスと表示が異なることが数時間ほど存在する可能性があります。
このシラバスが原因でいかなる問題が発生しても責任は一切取りませんので、よろしくお願いします。<br/>

アクセス解析ツールについて<br/>

当サイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を使用しています。このGoogleアナリティクスはデータの収集のためにCookieを使用しています。このデータは匿名で収集されており、データ分析のためにサードパーティサーバーを通してIPアドレスを取得し、Goolge Analyticsで取得します。この情報は、サイトの利用状況を分析するために使用されますが、個人は特定できないものになっています。Googleアナリティクスによるデータ収集や処理方法については、Googleのプライバシーポリシーをご覧ください。<br/>
<br/>
この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。この規約に関しての詳細はGoogleアナリティクスサービス利用規約のページやGoogleポリシーと規約ページをご覧ください。
<br/>
<br/>
<br/>

2024.3.23
  </p>;
}
